[
{"title": "00 Schneider – Jagd auf Nihil Baxter", "movie_url": "https://en.wikipedia.org/wiki/00_Schneider_%E2%80%93_Jagd_auf_Nihil_Baxter", "year": "1994", "source_url": "https://en.wikipedia.org/wiki/List_of_films:_numbers", "table_data": {"Directed by": "Helge Schneider", "Written by": "Helge Schneider, Brötchen", "Produced by": "Hanno Huth", "Starring": "Helge Schneider, Helmut Körschgen, Andreas Kunze", "Cinematography": "Christoph Schlingensief", "Edited by": "Andrea Schumacher", "Music by": "Helge Schneider", "Release date": "22 December 1994 ( 1994-12-22 )", "Running time": "90 minutes", "Country": "Germany", "Language": "German"}, "info": ["00 Schneider – Jagd auf Nihil Baxter  ( Hunt for Nihil Baxter )  is a German comedy-film directed by  Helge Schneider . It was released on 22 December 1994.", "He wrote the  script  as well as the music, did  film direction , and played the main character and several additional roles.", "The funny clown Bratislav Metulskie is found dead in the \"Apollo\" circus. Retired inspector 00 Schneider is asked to take over the case. Schneider and his aged sidekick Körschgen investigate the murder and soon identify a suspect by the name of Nihil Baxter. The passionate art collector is a little nuts and does not cultivate social contacts at all. Inspector Schneider investigates at the circus and pays Baxter a visit. Baxter makes up an alibi and claims that he was working on a painting when the murder took place. Körschgen finds out that the picture is an imitation. When Baxter tries to escape to  Rio  by plane after he stole a sculpture from the practice of Dr. Hasenbein, 00 Schneider and his sidekick are also on board. As they are incognito, they are able to arrest the criminal with the help of the world-famous \"sniffer dog nose\" pilot.", "Helge Schneider has described his second film as his best. The film is a colorful kaleidoscope of characters, scenes and locations. Even more than the other Schneider films, this one is characterized by a loose, often almost superfluous basic plot, which Schneider repeatedly tilts, twists or even abandons with great pleasure. An avant-garde sequence in the Neandertal Museum in Mettmann, for example, which is accompanied by an opera parody sung by Schneider himself (Schneider sings the operating instructions for a Uher tape recorder backwards), turns out to be the detective's dream. What was most important to Schneider was the portrayal of the characters' lives and everyday lives. Added to this was his special way of filming: basically without a script.", "Filming took place in Schneider's hometown of Mülheim an der Ruhr and in the rest of the Ruhr area, such as in Gelsenkirchen, where the Circus Apollo performed in the so-called Kesselpark .", "With the inspector, Schneider brings a character to the screen that he developed in his crime novels and had already introduced in Texas: Doc Snyder Holds the World in Suspense . An important stylistic feature of the novels is the exaggerated depiction of violence that is absurd, which was not implemented in the film in this form. But even this 00 Schneider has a latent arbitrariness and brutality, for example when he destroys a little boy's scooter. A scene in which he fights with Nihil Baxter did not make it into the final version of the film.", "Schneider can be seen in four roles in the film: as Inspector 00 Schneider, as criminal Nihil Baxter, as amateur surgeon Dr. Hasenbein and as pop star Johnny Flash, which required the sometimes complicated use of doubles. Schneider deliberately chose a double who did not look like him. A scene with the inspector, Körschgen and Nihil Baxter in the same room became a technical challenge when Körschgen was also unable to take part due to illness.", "Other double roles are played by Andreas Kunze (as Mrs. Inspector 00 Schneider and as a tiger in the circus) and Thomas Busch (as secretary and double of Helge Schneider).", "The cars used in the film are a Jaguar E-Type, a Peugeot 404 and a Triumph TR3.", "[ 1 ]"], "imdb_id": "tt0109000"},
{"title": "One Million Years B.C.", "movie_url": "https://en.wikipedia.org/wiki/One_Million_Years_B.C.", "year": "1966", "source_url": "https://en.wikipedia.org/wiki/List_of_films:_numbers", "table_data": {"image_url": "https://upload.wikimedia.org/wikipedia/en/thumb/5/5a/Original_1966_UK_One_Million_Years_B.C._poster.jpeg/250px-Original_1966_UK_One_Million_Years_B.C._poster.jpeg", "Directed by": "Don Chaffey", "Screenplay by": "Michael Carreras [ 1 ]", "Based on": "One Million B.C. 1940 film by Mickell Novack George Baker Joseph Frickert", "Produced by": "Michael Carreras", "Starring": "Raquel Welch John Richardson Percy Herbert Robert Brown Martine Beswick", "Cinematography": "Wilkie Cooper", "Edited by": "Tom Simpson", "Music by": "Mario Nascimbene", "Production companies": "Hammer Film Productions Seven Arts", "Distributed by": "Warner-Pathé Distributors", "Release dates": "25 October 1966 ( 1966-10-25 ) ( London ) 30 December 1966 ( 1966-12-30 )", "Running time": "100 minutes (U.K.) 91 minutes (U.S.)", "Country": "United Kingdom", "Language": "English", "Budget": "£422,816 [ 2 ]", "Box office": "$8 million ( United States ) [ 2 ]"}, "info": ["One Million Years B.C.  is a 1966 British  adventure   fantasy film  directed by  Don Chaffey . The film was produced by  Hammer Film Productions  and  Seven Arts , and is a remake of the 1940 American  fantasy film   One Million B.C. . The film stars  Raquel Welch  and  John Richardson , set in a fictional age of  cavemen  and  dinosaurs  existing together. Location scenes were filmed on the  Canary Islands  in the middle of winter, in late 1965. The UK release prints of this film were printed in dye transfer  Technicolor . The  U.S.  version released by  20th Century Fox  was cut by nine minutes, [ 3 ]  printed in  DeLuxe Color , and released in 1967. [ 4 ]", "Like the original film, this remake is largely ahistorical. It portrays dinosaurs and  humans  living at the same point in time; according to the  geological time scale , the last non-avian dinosaurs became extinct  66 million years ago , and modern humans ( Homo sapiens ) did not exist until about 300,000 years B.C.  Ray Harryhausen , who animated all of the dinosaur attacks using  stop-motion  animation techniques, commented on the U.S.  King Kong  DVD that he did not make  One Million Years B.C.  for \"professors...who probably don't go to see these kinds of movies anyway.", "Men of the dark-haired Rock tribe, led by chief Akhoba, who is accompanied by his rivalrous sons, Tumak and Sakana, capture and kill a  warthog  and return to share it with the rest of the tribe. Tumak and Akhoba fight over the meat, and Akhoba banishes Tumak to the harsh desert. After surviving several encounters with various prehistoric creatures, Tumak collapses on a remote beach and is spotted by Loana and other women of the fair-haired Shell tribe. Joined by some of the men from the tribe, Loana rescues Tumak from  an  Archelon  which is driven into the sea. Tumak is taken to the Shell tribe's village where he discovers they are more civilized and advanced than the Rock Tribe.", "Back at the Rock tribe, Sakana tries to seize power by killing Akhoba. Akhoba survives, but is a broken man as Sakana becomes the new leader.", "With the Shell tribe, Tumak rescues a small girl from an attack by an  Allosaurus , endearing him to Loana. However, Tumak is banished from the village after he fights Shell tribe member Ahot for possession of the spear Tumak used to fight the creature. Loana decides to accompany Tumak, and Ahot surrenders the spear to Tumak in a gesture of good will. Tumak, with Loana in tow, wanders back to the Rock Tribe camp, but again, there are altercations. They eventually witness an epic fight between a  Triceratops  and a  Ceratosaurus  after they encountered and are chased by one of them. The most dramatic fight is a fight between Tumak's current love interest Loana and his former lover Nupondi. Loana wins the fight but refuses to strike the killing blow, despite the encouragement from the other members of the tribe. Sakana resents Tumak's and Loana's attempts at incorporating Shell tribe ways into their culture.  While the Rock tribe is swimming, a female  Pteranodon  attacks and snatches Loana to feed her to her offspring. However, a  Rhamphorhynchus  intervenes and a fight ensues. Loana is dropped into the sea and makes it to shore. At first, Tumak mistakenly believes Loana is dead, but they are soon reunited.", "Sakana leads a group of like-minded fellow hunters in an armed revolt against Akhoba. Tumak, Ahot and Loana, and other members of the Shell tribe arrive and join the fight against Sakana. In the midst of the battle, a  volcano  suddenly erupts. Members of both tribes are killed by either the effects of the volcano, or by their attackers. Sakana is speared to death and Akhoba is crushed by falling rock. Tumak, Loana, and the surviving members of both tribes emerge from the desolation and jointly set off to find a new home, with Tumak as the new leader.", "Hammer Films has enjoyed success with a number of remakes, and  Kenneth Hyman  of  Seven Arts Productions  - Hammers' key financial partner at the time - wanted to remake  King Kong . When they were unable to obtain the rights, Hyman and producer Michael Carreras decided to remake  One Million B.C.  (1940). Carreras hired Ray Harryhausen to do the effects and Don Chaffey to direct. [ 6 ]", "Originally Hammer offered the role of Loana to  Ursula Andress , who had just made  She  for Hammer. When Andress passed on the project due to commitments and salary demands, a search for a replacement resulted in the selection of Welch. [ 7 ]  Welch, who had finished doing  Fantastic Voyage  for Fox, was under contract to the studio (who held U.S. distribution rights for the film) and was told by studio President  Richard Zanuck  that she would be loaned out to Hammer for the production. Although reluctant, Welch said that the selling point was the chance to spend six to eight weeks of filming in London (while shooting interiors) during the height of its \"swinging\" period. [ 8 ]  Her male lead, John Richardson, had just appeared in  She  alongside Andress. [ 6 ]", "The exterior scenes were filmed on  Lanzarote  and  Tenerife  in the  Canary Islands  in the middle of winter. The film features the  Echium wildpretii  plant, as a homage to Tenerife's unique  endemic  flora. However, the plants are set in scenes filmed on the Lanzarote beach. In actuality, this plant only flowers from May to June, and never in the time frame of the filming. It is found in Tenerife mountain zones higher than 1,600 m (5,200 ft). As a conclusion , the endemic plants featured in the movie were plastic replacements.\nAs there were no active volcanoes in the Canary Islands, the studio had to construct a 6–7 ft (2-metre) high volcano on the  Associated British Picture Corporation 's studio back lot. The eruption, lava explosions and lava flows were composed of a mixture of wallpaper paste, oatmeal, dry ice and red dye. [ citation needed ]  Harryhausen filmed the  dinosaur  visuals in his personal studio in  London .", "As the Shell people are attacked by a giant turtle, the women call it  Archelon  which is the real scientific name for the animal. The film uses six live creatures: a  vulture , a  python , a  green iguana , a  warthog , a  Loaghtan  and a  tarantula  (a  cricket  can be seen at the tarantula's side). Ray Harryhausen was asked repeatedly about these unanimated creatures, and he confessed they were his idea. At the time, he felt the use of real creatures would convince the audience that all of what they were about to see was indeed real.", "Shortly after, Tumak encounters a dinosaur skeleton, which helped build audience anticipation for further dinosaur encounters. This supposedly massive skeleton was actually only about 12 inches in length, made of plaster and shot against a blue backing and matted into the foreground.", "The scene where the young  Allosaurus  attacks the village is similar to one in the  original film . Shortly after the creature appears it plucks a man out of the water. They used an actor suspended on wires and Harryhausen positioned an animated model man over the actor, on the rear projection plate; thus it seemed as if the live actor was being eaten. Another technically complex scene in this part of the film was when a man fighting the young  Allosaurus  is trapped under a shelter: the dinosaur grabs a support and collapses it. The team used a full-size shelter rigged to collapse at that point during the action. Harryhausen then placed a miniature part in the creature's mouth which, when all lined up on the rear projection plate, blended in perfectly. The final significant scene in this sequence is when Tumak impales the creature on a spear from below. John Richardson, the actor who played Tumak, held nothing in the long shots and pretended to have a pole in his hands, but he did hold a pole in the close-up shots. A miniature pole was built and used for the long shots. It was placed in the studio in front of Richardson's hands, and then Harryhausen animated the young  Allosaurus  suspended on wires in front of John, on top of the miniature pole.", "The  Pteranodon  sequence took much time to create, primarily because of how hard it would be to make a model  pterosaur  pick up a real woman. However the solution was simple: Instead of using a large crane on location, the crew had Raquel Welch fall behind a rock, and then the model  Pteranodon  swoops down and flies off with a model of Welch, which was substituted during the single second in which she is behind the rock and not visible. Later, when the creature takes her to its nest, the nest was matted into the scene atop a real rock face by double printing the film. For the  Pteranodon  and  Rhamphorhynchus  fight scene, when she is dropped into the water, Harryhausen and the crew released her from two dummy rubber  Pteranodon  claws and while the real Welch fell onto a mattress, the film cut to a long shot of the Welch model suspended on wires. [ 9 ]", "Robert Brown (Akhoba) wears makeup similar to that worn by  Lon Chaney Jr.  in the same role in the 1940 version,  One Million B.C. [ citation needed ]", "Welch wore a bikini made of fur and hide in the film. She was described as \"wearing mankind's first bikini\" and the bikini was described as a \"definitive look of the 1960s\". The publicity photograph of Welch from the film became a best-selling pinup poster, [ 10 ]  and something of a cultural phenomenon. [ 11 ] [ 12 ]", "The iconic image was copied by the artist  Tom Chantrell  to create the film poster promoting the theatrical release of  One Million Years B.C.  Welch's depiction is accompanied by the film's title in bold red lettering across a landscape populated with dinosaurs. [ 13 ]", "Welch stated in a 2012 interview that three form-fitting bikinis were made for her, including two for a wet scene and a fight scene, by costume designer  Carl Toms : \"Carl just draped me in doe-skin, and I stood there while he worked on it with scissors.\" Many noted photographers had been flown to Tenerife by 20th Century Fox on a publicity junket, [ citation needed ]  but the iconic pose of Welch was taken by the unit still photographer. [ 14 ]  The poster is a story element in the film  The Shawshank Redemption . [ 15 ] [ 16 ]", "Composer  Mario Nascimbene  was in charge of the film's music and  score . A  soundtrack  was released in Italy as a 7-track limited edition vinyl LP on the Intermezzo label in 1985. [ 17 ]  It was re-released in Italy on  compact disc  in 1994 (now out of print) as a soundtrack compilation including two other  Hammer films . [ 18 ] \nThe original score for the film:", "It was first screened on 25 October 1966 at the Warner Theatre, London, with a general release in the United Kingdom on 30 December 1966, by  Warner-Pathé . It was released in the United States on 21 February 1967, by  20th Century Fox . [ 19 ]  The U.S. cut was censored for a broader audience, losing around nine minutes. Deleted scenes included a provocative dance from  Martine Beswick , a gruesome end to one of the  ape men  in the cave and some footage of the young  Allosaurus ' s attack on the Shell tribe. On 17 October 1966, the  British Board of Film Classification  announced that the film would receive an A certificate rating. It is currently a PG certificate applied on video in March 1989 distributed by  Warner Home Video  Ltd. [ 20 ]", "The film was originally available on  VHS  and  laserdisc . [ 21 ]  In 2002 Warner Bros. released a UK DVD, including a \"Raquel Welch in the Valley of the Dinosaurs\"  featurette , a 12-minute interview with Ray Harryhausen and the theatrical trailer. [ 22 ]  A Region 1 DVD (featuring the U.S. edit) was released by 20th Century Fox in 2004. [ 23 ]", "In October 2016, a special two-disc 50th anniversary edition DVD and  Blu-ray  was released in the UK by  Studio Canal , with new interviews with Welch and Beswick, new Harryhausen storyboard stills, and other promotional imagery. [ 24 ]  In the United States, a Blu-ray was released on 14 February 2017 by  Kino Lorber  Studio Classics and includes the international (Disc 1) and U.S. cut (Disc 2) of the film. This issue has more bonus material than the UK edition, including previous interviews with Welch and Harryhausen from 2002 and an audio commentary by film historian Tim Lucas. [ 25 ]", "Despite the censorship upon release in the U.S., the film was still popular and made $2.5 million in U.S. rentals during its first year of release. [ 26 ] [ 27 ]  It was one of the twelve most popular films at the British box office in 1967. [ 28 ]", "According to Fox records, the film needed to earn $2,250,000 in rentals to break even and made $4,425,000, meaning it made a solid profit. [ 29 ]", "In 1968, it was re-released in the UK on a  double feature  alongside  She  (1965), an earlier Hammer film. The pairing became the ninth most popular theatrical release of the year. [ 30 ]", "On  review aggregator   Rotten Tomatoes , the film holds an approval rating of 67% based on 15 reviews, with an average rating of 5.64/10. [ 31 ] \nAmong contemporary reviews,  Variety  wrote \"the whole thing is good humored full-of-action commercial nonsense, but the moppets will love it and older male moppets will probably love Miss Welch\"; [ 32 ]  and  The Monthly Film Bulletin  noted \"Very easy to dismiss the film as a silly spectacle; but Hammer production finesse is much in evidence and Don Chaffey has done a competent job of direction. And it is all hugely enjoyable\"; [ 33 ]  while more recently,  The Times  wrote that \"seen nowadays it is a kitschy, retro scream. Yet as dinosaurs and giant sea-turtles roam the volcanic earth in  One Million Years BC , this is also a chance to appreciate the early work of the great special effects pioneer Ray Harryhausen.\" [ 34 ]  Similarly,  TV Guide  concluded \"While far from being one of Harryhausen's best films (the quality of which had little to do with his abilities), the movie has superb effects that are worth a look for his fans.\" [ 35 ]", "All the dinosaur models from this film still exist, although the  Ceratosaurus  and  Triceratops  were re-purposed for  The Valley of Gwangi  (1969), as Gwangi the  Allosaurus  and the  Styracosaurus .  One Million Years B.C.  was the first in an unconnected series of prehistoric films from Hammer. It was followed by  Prehistoric Women  (1967),  When Dinosaurs Ruled the Earth  (1970) and  Creatures the World Forgot  (1971). [ 36 ]  Stock footage depicting the landslide was reused for Alex's daydream scene in  Stanley Kubrick 's 1971 film  A Clockwork Orange . [ 37 ]  Although the films are not connected, the 1970 follow-up film,  When Dinosaurs Ruled the Earth , did use some of the same language as this movie, dialogue that was also used in the 1940 original. Words such as M’Kan (Kill) and Akita (Look/there) are used in all three films. The character played by Robert Brown (and, in the original, Lon Chaney Jr) is called Akhoba, a word used in the 1970 film to mean mercy. [ 38 ]", "The film was adapted into a 15-page comic strip for the May 1978 issue of the magazine  House of Hammer  (volume 2 #14, published by  Top Sellers Ltd ). It was drawn by  John Bolton  from a script by  Steve Moore . The cover of the issue featured a painting by  Brian Lewis  of Welch in the famous fur bikini.", "In the 1994 film  The Shawshank Redemption , a large poster of Welch in her role as Loana is used by  Andy Dufresne  (played by  Tim Robbins ) to conceal his tunnel digging.", "In the 2021 film  Belfast , Buddy (played by  Jude Hill ) and his family go to the cinema and his father (played by  Jamie Dornan ) chooses to watch  One Million Years B.C.", "Raquel Welch's fur bikini costume design and overall looks in this film served as the primary basis for the creation of the character  Ayla  for the 1995 video game  Chrono Trigger . Ayla is a prehistoric woman that lived in \"65000000 B.C.\" timeline, and is also a subject of anachronistic and ahistoric narrative, with other contemporaries from her timeline being depicted as a mixture of Rock and Shell people from this movie, who live in a world where dinosaurs still roam the land."], "imdb_id": "tt0060782"},
{"title": "One Hour Photo", "movie_url": "https://en.wikipedia.org/wiki/One_Hour_Photo", "year": "2002", "source_url": "https://en.wikipedia.org/wiki/List_of_films:_numbers", "table_data": {"image_url": "https://upload.wikimedia.org/wikipedia/en/thumb/2/2d/One_Hour_Photo_movie.jpg/250px-One_Hour_Photo_movie.jpg", "Directed by": "Mark Romanek", "Written by": "Mark Romanek", "Produced by": "Pamela Koffler Christine Vachon Stan Wlodkowski", "Starring": "Robin Williams Connie Nielsen Michael Vartan Gary Cole Eriq La Salle", "Cinematography": "Jeff Cronenweth", "Edited by": "Jeffrey Ford", "Music by": "Reinhold Heil Johnny Klimek", "Production companies": "Catch 23 Entertainment Killer Films John Wells Productions", "Distributed by": "Fox Searchlight Pictures", "Release dates": "January 13, 2002 ( 2002-01-13 ) ( Sundance ) August 21, 2002 ( 2002-08-21 ) (United States)", "Running time": "96 minutes", "Country": "United States", "Language": "English", "Budget": "$12 million [ 1 ]", "Box office": "$52.2 million [ 1 ]"}, "info": ["One Hour Photo  is a 2002 American  psychological thriller  film [ 2 ] [ 3 ]  written and directed by  Mark Romanek . It stars  Robin Williams  as a photo technician who develops an unhealthy obsession with a family to whom he has long provided services.  Connie Nielsen ,  Michael Vartan ,  Gary Cole , and  Eriq La Salle  appear in supporting roles.", "The film premiered at the  2002   Sundance Film Festival , followed by a limited release on August 21, 2002, and a wider release on September 13. [ 4 ] [ 5 ]  It received positive reviews from film critics, with praise for Williams' against- type  performance, and grossed over $52 million on a $12 million budget. [ 6 ]", "Sy Parrish is a photo technician at a  one-hour photo lab  in  big-box store  SavMart. He lives alone with a pet hamster, has no friends or love life, and lives only for his work, which he considers a \"vital service\". His favorite customers are the Yorkin family, whose photos he has developed for many years. Over the years, he has grown obsessed with the family, enshrining them in his home with their photos that he secretly copies.", "Sy eventually manages to spark a connection with Nina Yorkin when he pretends to be interested in a book that he saw her purchase. Nina learns that Sy lives a solitary existence, something only her son Jake had considered previously. The next day, store manager Bill Owens discovers, through an audit investigation on company expenditures, that over the span of nine years, Sy has printed many more prints than those that have been ordered and paid for by the customers. For this, as well as other infractions, Sy is fired from SavMart. Bill allows him to finish the week, although Sy is devastated.", "While inspecting a customer's photos, Sy discovers that Will Yorkin is having an  affair , and his idyllic conception of the Yorkins as the perfect family is shattered. He surreptitiously places the photos of Will and his mistress, Maya Burson, into a packet of photos that Nina was scheduled to pick up. Meanwhile, Sy takes  paparazzi -style photos of Bill's young daughter, sends the film with the photos to Yoshi (another SavMart employee), who turns them over to Bill, who reports the matter to the police.", "While detectives James Van Der Zee and Paul Outerbridge discover Sy's obsession, Sy confronts Will and Maya during a rendezvous in their hotel room. Armed with a knife and a camera, Sy forces the lovers to pose naked in sexual positions while he takes pictures. After the confrontation, Sy notices that the police have arrived at the hotel, and escapes through an emergency exit. The exit door trips an alarm, and Van Der Zee pursues Sy while Outerbridge finds Will and Maya physically unharmed but emotionally traumatized. The police apprehend Sy in the parking garage. On his arrest, Sy claims \"I just took pictures.", "In the police interrogation room, Sy begins speaking. Sy implies that his father took pornographic photos of Sy when he was a child. Before the detective leaves, Sy asks if he can see his photos; the detective obliges and we see that they are merely shots of random objects and furnishings of a hotel room, i.e., there was no film left when Sy was terrorizing Will and Maya. The film ends with a photo of the Yorkins with Sy, each person in the photo smiling.", "Trent Reznor  of the band  Nine Inch Nails  was originally asked to compose the film's  score . However, early in the process, Romanek was allegedly pressured by the studio to hire a \"real composer\", and Reznor was dropped from the production. Some of the music that Reznor created for the film evolved into material found on the Nine Inch Nails  EP   Still . [ 7 ] [ 8 ]", "In accordance with the photography-themed movie, the names of several characters are drawn from actual photographers: Sy's assistant at the Savmart, Yoshi Araki (named for  Nobuyoshi Araki ), manager Bill Owens ( Bill Owens ), Det. Van Der Zee ( James Van Der Zee ), Det. Outerbridge ( Paul Outerbridge ), Maya Burson ( Nancy Burson ), and Savmart customers Mrs. von Unwerth ( Ellen von Unwerth ) and Mr. Siskind ( Aaron Siskind ).", "In one of the voice-over pieces, Sy can be heard saying, \"They actually believe that any idiot that attends a two-day seminar can master the art of making beautiful prints in less than an hour. But of course, like most things, there's far more to it than meets the eye.\" Williams prepared for the role by training for two and a half days in a Southern California photo development lab. [ 9 ]", "In an interview, Romanek said that he was inspired to create the movie by films from the 1970s about \"lonely men\", notably  Taxi Driver  (1976).", "In the  DVD  commentary, Romanek says that  Jack Nicholson  was first approached to play the lead character. Nicholson turned down the role reportedly because he thought that the character was too similar to the role he played in  The Shining  (1980).", "On review aggregator website  Rotten Tomatoes ,  One Hour Photo  holds an approval rating of 82% based on 195 reviews, with an average rating of 7/10. The site's critics consensus reads: \"Robin Williams is very effective in this creepy, well-shot thriller.\" [ 10 ]  At  Metacritic , the film has a weighted average score of 64 out of 100, based on 35 critics, indicating \"generally favorable reviews\". [ 11 ]  Audiences polled by  CinemaScore  gave the film an average grade of \"C\" on a scale of A+ to F. [ 12 ]", "Roger Ebert  of the  Chicago Sun-Times  gave the film three and a half stars out of four, and wrote, \"Robin Williams plays Sy, another of his open-faced, smiling madmen, like the killer in  Insomnia . He does this so well you don't have the slightest difficulty accepting him in the role.\" [ 13 ]", "Mick LaSalle  of the  San Francisco Chronicle  noted that the film is \"not nearly as intelligent, thoughtful or penetrating as it promises to be. Yet the consistent delicacy and emotional clarity of Williams' acting in  One Hour Photo  makes the picture impossible to dismiss.\" [ 14 ]", "In 2013  GamesRadar+  named the lead character one of the \"50 Creepiest Movie Psychopaths\". [ 15 ]", "The film's  limited release  began on August 21, 2002, in seven theaters, opening to a $321,515 weekend, with an average of $45,930 per theater. Its  wide release  began on September 13, with a 1,212-theater count. Still, the film made just over $8 million that weekend, and went on to gross $31,597,131 in the US, with an additional $20,626,175 in overseas territories, for an international total of $52,223,306. [ 1 ]"], "imdb_id": "tt0265459"},
{"title": "One Flew Over the Cuckoo's Nest", "movie_url": "https://en.wikipedia.org/wiki/One_Flew_Over_the_Cuckoo%27s_Nest_(film)", "year": "1975", "source_url": "https://en.wikipedia.org/wiki/List_of_films:_numbers", "table_data": {"image_url": "https://upload.wikimedia.org/wikipedia/en/2/26/One_Flew_Over_the_Cuckoo%27s_Nest_poster.jpg", "Directed by": "Miloš Forman", "Screenplay by": "Lawrence Hauben Bo Goldman", "Based on": "One Flew Over the Cuckoo's Nest by Ken Kesey", "Produced by": "Saul Zaentz Michael Douglas", "Starring": "Jack Nicholson Louise Fletcher William Redfield", "Cinematography": "Haskell Wexler Additional photography: Bill Butler William Fraker", "Edited by": "Richard Chew Lynzee Klingman Sheldon Kahn", "Music by": "Jack Nitzsche", "Production company": "Fantasy Films", "Distributed by": "United Artists", "Release date": "November 19, 1975 ( 1975-11-19 )", "Running time": "135 minutes", "Country": "United States", "Language": "English", "Budget": "$3–4.4 million [ 1 ] [ 2 ]", "Box office": "$163.3 million [ 3 ]"}, "info": ["One Flew Over the Cuckoo's Nest  is a 1975 American  psychological   comedy-drama  film [ 4 ]  directed by  Miloš Forman , based on  the 1962 novel of the same name  by  Ken Kesey . The film stars  Jack Nicholson  as a new patient at a  mental institution  and  Louise Fletcher  as the domineering head nurse.  Will Sampson ,  Danny DeVito ,  Sydney Lassick ,  William Redfield ,  Christopher Lloyd  and  Brad Dourif  play supporting roles, with the latter two making their feature film debuts.", "Originally announced in 1962 with  Kirk Douglas  starring, the film took 13 years to develop. [ 5 ]  Filming finally began in January 1975 and lasted three months, on location in  Salem, Oregon  and the surrounding area, and in  Depoe Bay  on the north  Oregon  coast. The producers shot the film in the  Oregon State Hospital , an actual psychiatric hospital, which is also the novel's setting. The hospital is still in operation, though the original buildings in the film have been demolished. The film was released on November 19, 1975.", "One Flew Over the Cuckoo's Nest  received critical acclaim, and is considered by critics and audiences to be one of the  greatest films ever made . It is the second of three films to  win all five major   Academy Awards  ( Best Picture ,  Best Actor ,  Best Actress ,  Director , and  Screenplay ) following  It Happened One Night  (1934), and preceding 1991's  The Silence of the Lambs . It won numerous  Golden Globe  and  BAFTA Awards . In 1993, the film was deemed \"culturally, historically, or aesthetically significant\" by the United States  Library of Congress , and selected for preservation in the  National Film Registry . Additionally,  One Flew Over the Cuckoo's Nest  was ranked No. 33 on the  American Film Institute 's updated  100 Years... 100 Movies  list in 2007.", "In 1963 Oregon,  Randle McMurphy  is incarcerated for the  statutory rape  of a 15-year-old girl (which he claims he committed under the assumption that she was an 18-year-old), with five previous arrests for assault. He feigns mental illness so that he can be moved to a mental institution and avoid  hard labor  at a  work farm . The medical ward is dominated by the cold, passive-aggressive  Nurse Ratched , who intimidates her patients and maintains control through fear.", "The other patients include young, anxious, stuttering Billy Bibbit; Charlie Cheswick, who is prone to temper tantrums; delusional, child-like Martini; the articulate and repressed Dale Harding; belligerent and profane Max Taber;  epileptics  Jim Sefelt and Bruce Fredrickson; quiet but violent-minded Scanlon; tall,  deaf-mute   Native American  Chief Bromden; and several others with chronic conditions.", "Ratched sees McMurphy's lively, rebellious presence as a threat to her authority, to which she responds by confiscating and rationing the patients' cigarettes and suspending their card-playing privileges. McMurphy finds himself in a battle of wills against Ratched. One night, he makes a bet with the other inmates that he can escape by tearing a hydrotherapy fountain off its base and hurling it through a locked window, but is predictably unable to lift it. Shortly after, he hijacks a charter bus, picks up his girlfriend Candy, and escapes with several patients to steal a recreational fishing boat, exposing them to the outside world and encouraging them to discover their abilities and find self-confidence.", "After an  orderly  tells him that his sentence term does not apply in the mental institution, and can become indefinite, McMurphy questions why no one had told him this before. He also learns that he, Chief, and Taber are the only non-chronic patients who have been involuntarily committed; the others have committed themselves voluntarily but are too afraid to leave. After Cheswick bursts into a fit and demands his cigarettes from Ratched, McMurphy starts a fight with the orderlies, and Chief intervenes to help him.", "McMurphy, Chief, and Cheswick are then sent to the disturbed ward, and Chief reveals to McMurphy that he can speak and hear normally, having faked deaf-muteness to avoid engaging with anyone. The two make plans to escape to Canada together. McMurphy is subjected to  electroconvulsive therapy , and returns to the ward pretending to be brain-damaged before revealing that the treatment has made him even more determined to defeat Ratched. McMurphy and Chief plan to throw a secret Christmas party for their friends after Ratched and the orderlies leave for the night, before making their escape.", "McMurphy sneaks Candy and her friend Rose into the ward, each bringing bottles of alcohol for the party, and bribes the night orderly Turkle to allow the party. McMurphy and Chief prepare to escape, inviting Billy to come with them. Billy refuses but asks for a \"date\" with Candy; McMurphy arranges for him to have sex with her. McMurphy and the others get drunk, and McMurphy falls asleep instead of escaping with Chief.", "Ratched arrives in the morning to find the ward in disarray; most patients have passed out. She discovers Billy and Candy in bed together and aims to embarrass Billy in front of everyone. Billy manages to overcome his stutter and stands up to Ratched. When she threatens to tell his mother, Billy cracks under the pressure and reverts to stuttering, before Ratched orders he be locked in a separate room as punishment. McMurphy punches an orderly when trying to escape out of a window with Chief, causing the other orderlies to intervene. Locked up alone, Billy kills himself by slitting his throat with a broken glass, causing a huge commotion. Ratched tries to control the situation by calling for the day's routine to continue as usual, but her nonchalant reaction enrages McMurphy, who begins strangling her. The orderlies violently subdue McMurphy, saving Ratched's life.", "Sometime later, Ratched is wearing a neck brace and speaking weakly although still sternly, and Harding leads the now unsuspended card-playing. McMurphy is nowhere to be found, leading to a rumor that he has escaped. Later that night, Chief sees McMurphy being returned to his bed. He is initially elated that McMurphy had kept his promise not to escape without him, until discovering that McMurphy has been  lobotomized . After tearfully embracing McMurphy, Chief  smothers him to death  with a pillow. He then rips the hydrotherapy fountain off its base and throws it through the window as McMurphy had earlier attempted. Chief escapes, with Taber and the other inmates awakening to cheer him on as he runs into the surrounding countryside.", "In 1962, Kirk Douglas's company  Joel Productions  announced that it had acquired the rights to make Broadway stage and film adaptations of  One Flew Over the Cuckoo's Nest  with Douglas starring as McMurphy in both the play and the film,  Dale Wasserman  writing the stageplay, and  George Roy Hill  directing the film based on Wasserman's play.  Jack Nicholson  had also tried to buy the film rights to the novel but was outbid by Douglas. [ 6 ]  Wasserman's  1963–1964 Broadway stage adaptation  successfully opened, but Douglas was unable to find a studio willing to make the film with him. [ 5 ]", "Kirk Douglas hired  Miloš Forman  to direct after meeting him in  Prague  during a tour of the  Eastern Bloc .  Avco-Embassy Pictures  optioned the film in 1969, but Forman was prevented from directing the film by the  Warsaw Pact invasion of Czechoslovakia  and the beginning of the \" normalization \" period in which the  Soviet Union  forced  Czechoslovakia  to reverse most of its  Prague Spring  liberalization reforms. Forman and Douglas fell completely out of contact after the Czechoslovak  StB  put Forman under strict surveillance. It also intercepted a copy of the novel Douglas sent to his home in Prague, which meant he was unable to read the book. [ 5 ]", "Wasserman subsequently sold his film rights to Douglas in 1970, but then delayed the film for several more years with lawsuits. [ 5 ]  In 1971, Kirk Douglas's son  Michael Douglas  convinced his father to allow him to produce the film, as he was drawn to the novel's \"one man against the system\" plot due to his involvement with  student activism  at the  University of California, Santa Barbara . [ 2 ]  Michael Douglas optioned the film to director  Richard Rush , but Rush was unable to secure financing from major studios. [ 7 ] [ 8 ]  In March 1973, Michael Douglas announced a new deal in which he would co-produce the film with  Saul Zaentz   as the first project of  Fantasy Records ' new film division. [ 2 ] [ 5 ] [ 7 ]", "Zaentz, a voracious reader, felt an affinity with Kesey, and so after Hauben's first attempt he asked Kesey to write the screenplay. [ 2 ]  Kesey participated in the early stages of script development, but withdrew after creative differences with the producers over casting and narrative point of view; ultimately he filed suit against the production and won a settlement. [ 9 ]  Although Kesey was paid for his work, his screenplay from the first-person point of view of Chief Bromden was not used. Instead,  Lawrence Hauben  and  Bo Goldman  wrote a new screenplay from a third-person perspective. [ 5 ]", "Hal Ashby  was hired to replace Rush as director in 1973, but he was also replaced by Forman after Forman had successfully fled to the United States. Although Michael Douglas and Zaentz were unaware that Forman had been Kirk Douglas's first choice to direct, they began considering him after Hauben showed them Forman's 1967 Czechoslovak film  The Firemen's Ball . [ 5 ] [ 2 ]  Michael Douglas later said that the film \"had the sort of qualities we were looking for: it took place in one enclosed situation, with a plethora of unique characters he had the ability to juggle\". [ 2 ]", "Although Forman was suffering from a  mental health  crisis and refused to leave his  Hotel Chelsea  room in  New York City  for months, Douglas and Zaentz sent him a copy of the novel. Although Forman was not aware that the novel was the one which Douglas's father had hired him to direct in the 1960s, he quickly decided that it was \"the best material I’d come across in America\" and flew to California to discuss the film further with Douglas and Zaentz. [ 6 ]  They quickly hired Forman because, in Douglas's words, \"Unlike the other directors we saw, who kept their cards close to their chest, he went through the script page by page and told us what he would do.\" [ 2 ]  Forman wrote in 2012: \"To me, [the story] was not just literature, but real life, the life I lived in  Czechoslovakia  from my birth in 1932 until 1968. The  Communist Party  was my Nurse Ratched, telling me what I could and could not do; what I was or was not allowed to say; where I was and was not allowed to go; even who I was and was not.\" [ 10 ]", "Although Kirk Douglas allowed his son to produce the film, he remained interested in playing McMurphy. However, Ashby and Forman felt Kirk Douglas was too old for the role and decided to recast him. This decision would strain relations between Kirk and Michael Douglas for many years, although Michael Douglas claimed it had not been his decision to recast him. [ 11 ] [ 12 ]   Gene Hackman , [ 13 ] [ 14 ]   James Caan , [ 15 ]   Marlon Brando , [ 13 ] [ 14 ]  and  Burt Reynolds [ 16 ]  were all considered for the role of McMurphy. Ashby wanted 37-year-old Jack Nicholson to play McMurphy, but Douglas was unsure if he was right for the role and Forman's first choice was Reynolds. [ 17 ]  All four turned down the role, which ultimately went to Nicholson. [ 18 ]  Nicholson had never played this type of role before. Production was delayed for about six months because of Nicholson's schedule. Douglas later stated in an interview that \"that turned out to be a great blessing: it gave us the chance to get the ensemble right\". [ 2 ]  Nicholson did extensive research for the role and even met patients in a psychiatric ward to watch electroconvulsive shock therapy to prepare for the role.", "Danny DeVito  was the first to be cast, reprising his role as the patient Martini from the 1971 off-Broadway production. Chief Bromden (who turns out to be the title character), played by  Will Sampson , was referred by Mel Lambert (who portrayed the harbormaster in the fishing scene), a used car dealer Douglas met on an airplane flight when Douglas told him they wanted a \"big guy\" to play the part. Lambert's father often sold cars to Native American customers and six months later Lambert called Douglas to say: \"the biggest sonofabitch Indian came in the other day!\" [ 2 ]", "Jeanne Moreau ,  Angela Lansbury ,  Colleen Dewhurst ,  Geraldine Page ,  Ellen Burstyn ,  Anne Bancroft , and  Jane Fonda  all were considered to portray Nurse Ratched before  Lily Tomlin  was ultimately cast in the role. [ 5 ] [ 6 ]  However, Forman became interested in recasting Tomlin with  Louise Fletcher , who had a supporting role in the film, after viewing her film  Thieves Like Us  (1974). A mutual acquaintance, the casting director  Fred Roos , had already mentioned Fletcher's name as a possibility. Even so, it took four or five meetings, across one year, for Fletcher to secure the role of Nurse Ratched. [ 19 ] [ 5 ]  Her final audition was late in 1974, with Forman, Zaentz, and Douglas. The day after Christmas, her agent called to say she was expected at the  Oregon State Hospital  in Salem on January 4 to begin rehearsals. [ 20 ]  Tomlin subsequently left the film to replace Fletcher in  Nashville  (1975). In 2016, Fletcher recalled that Nicholson's salary was \"enormous\", while the rest of the cast worked at or close to scale. She put in 11 weeks, grossing  US$10,000  (equivalent to $58,000 in 2024). [ 20 ]", "Forman also considered  Shelley Duvall  for the role of Candy; coincidentally, she, Nicholson, and  Scatman Crothers  (who portrays Turkle) all later appeared as part of the main cast of  The Shining .  Bud Cort  was considered for the role of Billy Bibbit before  Brad Dourif  was cast. [ 21 ]", "Prior to commencement of filming, a week of rehearsals started on January 4, 1975, in Oregon shortly after Nicholson concluded his previous film  The Fortune  (1975). [ 5 ]  The cast watched the patients in their daily routine and at group therapy. Jack Nicholson and Louise Fletcher also witnessed  electroconvulsive therapy  being performed on a patient. [ 2 ]", "Principal photography began on January 13, 1975, and concluded approximately three months later. [ 5 ]  The film was shot on location in  Salem, Oregon , the surrounding area, and the coastal town of  Depoe Bay, Oregon . [ 5 ] [ 22 ] [ 23 ]", "The producers decided to shoot the film in the  Oregon State Hospital , an actual mental hospital, as this is also the setting of the novel. [ 24 ]  The hospital's director, Dean Brooks, was supportive of the filming and eventually ended up playing the character of Dr. John Spivey in the film. Brooks identified a patient for each of the actors to shadow, and some of the cast even slept on the wards at night. He also wanted to incorporate his patients into the crew, to which the producers agreed. Douglas recalls that it was not until later that he found out that many of them were criminally insane. [ 2 ]", "For the group therapy scenes, Forman and his cinematographer Haskell Wexler used three cameras to record all shots for the scene simultaneously. Although this was unusual for the time and more expensive, it allowed Forman and Wexler to capture the actors' authentic reactions to each other. [ 2 ]", "As Forman did not allow the actors to see the day's filming, this led to the cast losing confidence in him, while Nicholson also began to wonder about his performance. Douglas convinced Forman to show Nicholson something, which he did, and restored the actor's confidence. [ 2 ]", "Haskell Wexler  was fired as cinematographer and replaced by  Bill Butler . Wexler believed his dismissal was due to his concurrent work on the documentary  Underground , in which the radical militant group  the Weather Underground  were being interviewed while hiding from the law. However, Forman said he had terminated Wexler's services over artistic differences. Douglas also claimed Wexler wanted to get Forman fired in order to direct the film himself, and was fueling the cast's distrust of Forman and lack of confidence in their own performances. Both Wexler and Butler received  Academy Award  nominations for Best Cinematography for  One Flew Over the Cuckoo's Nest , though Wexler said there was \"only about a minute or two minutes in that film I didn't shoot\". [ 25 ]", "According to Butler, Nicholson refused to speak to Forman: \"...[Jack] never talked to Miloš at all, he only talked to me\". [ 26 ]", "The production went over the initial budget of $2 million and over-schedule, but Zaentz, who was personally financing the movie, was able to come up with the difference by borrowing against his company, Fantasy Records. The total production budget came to $4.4 million. [ 2 ]", "The film premiered at the Sutton and Paramount Theatres in New York City on November 19, 1975. [ 27 ]  It was the  second-highest-grossing film released in 1975  in the United States and Canada at $109 million, [ 1 ]  one of the  seventh-highest-grossing films of all time  at the time. [ 27 ]  As it was released toward the end of the year, most of its gross was in 1976 and was the highest-grosser for calendar year 1976 with rentals of $56.5 million. [ 28 ]", "Worldwide,  One Flew Over the Cuckoo's Nest  grossed $163,250,000. It was the highest-grossing film released by UA up to that time. [ 3 ] [ 27 ]", "Critics praised the film, sometimes with reservations.  Roger Ebert  said:  .mw-parser-output .templatequote{overflow:hidden;margin:1em 0;padding:0 32px}.mw-parser-output .templatequotecite{line-height:1.5em;text-align:left;margin-top:0}@media(min-width:500px){.mw-parser-output .templatequotecite{padding-left:1.6em}}", "Ebert later put the film on his \"Great Movies\" list. [ 30 ]  A.D. Murphy of  Variety  wrote a mixed review as well, [ 31 ]  as did  Vincent Canby  in  The New York Times :", "The film opens and closes with original music by composer  Jack Nitzsche , featuring an eerie  bowed saw  (performed by  Robert Armstrong ) and  wine glasses . On the score, reviewer Steven McDonald:", "The film won the  \"Big Five\" Academy Awards  at the  48th Oscar ceremony . These include the  Best Actor  for  Jack Nicholson ,  Best Actress  for  Louise Fletcher ,  Best Direction  for Forman,  Best Picture , and  Best Adapted Screenplay  for  Lawrence Hauben  and  Bo Goldman . The film has a 93% rating at  Rotten Tomatoes  based on reviews from 115 critics, with an average rating of 9.1/10. The website's critics consensus reads: \"Jack Nicholson and Louise Fletcher are worthy adversaries in  One Flew Over the Cuckoo's Nest , with Miloš Forman's more grounded and morally ambiguous approach to Ken Kesey's surrealistic novel yielding a film of outsized power.\" [ 34 ]  The film has an 84 rating on  Metacritic .", "While Kesey claimed never to have seen the movie, he disliked what he knew of it, [ 9 ]  which was confirmed by author  Chuck Palahniuk , who wrote: \"The first time I heard this story, it was through the movie starring Jack Nicholson. A movie that Kesey once told me he disliked.\" [ 35 ]", "In 1993, the film was deemed \"culturally, historically, or aesthetically significant\" by the United States  Library of Congress  and selected for preservation in its  National Film Registry . [ 36 ]", "The Japanese filmmaker  Akira Kurosawa  cited  Cuckoo's Nest  as one of his 100 favorite films. [ 37 ]", "In 2014,  WhatCulture  ranked Louise Fletcher' role second in top \"10 Most Convincing Movie  Psychopath  Performances\" [ 38 ]", "Pantera  singer  Phil Anselmo  released a music video, \" Choosing Mental Illness \", [ 39 ]  with his band  Philip H. Anselmo & The Illegals . The music video pays tribute to  One Flew Over the Cuckoo's Nest  and it  shows scenes recreated from the film with Anselmo playing McMurphy and the rest of the band playing other characters from the film, and Nurse Ratched played by actor Michael St. Michaels. [ 40 ]", "The film has been referenced several times on  The Simpsons , including an  episode  where  Homer  is committed to an insane asylum and meets a man who believes himself to be  Michael Jackson . In an episode from the  fourth season  of  It's Always Sunny in Philadelphia , titled \"Sweet Dee Has a Heart Attack\", Danny DeVito's character Frank Reynolds is part of subplot that directly parodies the film.", "Danny DeVito 's role in the parody is significant since he was cast in the original film as the character \"Martini\". In the episode of  It's Always Sunny in Philadelphia , a reference is made to DeVito's original role with a character in the parody named \"Martini\". Additionally, the 1975 film featured  Will Sampson  as Chief Bromden. In the parody, Tim Sampson, son of Will Sampson, plays \"Chief\" in mirroring his father's role in the film.", "In 2015, the film ranked 59th on  BBC 's \"100 Greatest American Films\" list, voted on by film critics from around the world. [ 53 ]", "American Film Institute"], "imdb_id": "tt0073486"},
{"title": "Day One", "movie_url": "https://en.wikipedia.org/wiki/Day_One_(1989_film)", "year": "1989", "source_url": "https://en.wikipedia.org/wiki/List_of_films:_numbers", "table_data": {"image_url": "https://upload.wikimedia.org/wikipedia/en/thumb/9/93/Day_One_%281989_film%29.jpg/250px-Day_One_%281989_film%29.jpg", "Genre": "Drama History", "Teleplay by": "David W. Rintels", "Directed by": "Joseph Sargent", "Starring": "Brian Dennehy David Strathairn Michael Tucker Hume Cronyn Richard Dysart Hal Holbrook Barnard Hughes John McMartin David Ogden Stiers Anne Twomey", "Music by": "Mason Daring", "Country of origin": "United States", "Original language": "English", "Executive producers": "Aaron Spelling E. Duke Vincent", "Producers": "Josette Perrotta David W. Rintels", "Cinematography": "Kees Van Oostrum", "Editor": "Debra Karen", "Running time": "145 mins.", "Production companies": "AT&T Spelling Television World International Network", "Network": "CBS", "Release": "March 5, 1989 ( 1989-03-05 )"}, "info": ["Day One  is a  made-for-TV   docudrama  film about  The Manhattan Project , the research and development of the  atomic bomb  during  World War II . It is based on the book by  Peter Wyden . The film was written by David W. Rintels and directed by  Joseph Sargent . It starred  Brian Dennehy  as General  Leslie Groves ,  David Strathairn  as Dr.  J. Robert Oppenheimer  and  Michael Tucker  as Dr.  Leo Szilard . It premiered in the United States on March 5, 1989 on the  CBS  network. It won the 1989  Emmy  award for  Outstanding Drama/Comedy Special. [ 1 ]  The movie received critical acclaim for its historical accuracy despite being a drama.", "When  Hungarian   physicist   Leo Szilard  leaves Europe he eventually arrives in the United States where, with the help of  Albert Einstein , he persuades the Federal government to build an  atomic bomb . General  Leslie Groves  selects physicist  J. Robert Oppenheimer  to head the  Los Alamos Laboratory  in  New Mexico , where the bomb is built. As  World War II  draws to a close, Szilard (whose idea was responsible for the progress made) has second thoughts about atomic weapons and debates how and when to use the bomb.", "The film focuses on the organization and the politics of the whole affair, such as tensions between the scientists and the military, the  communist  affiliation of many scientists around that time,  the risks of espionage and the decision whether to use the bomb after Germany is defeated. Concerning the actual scientific work on the bomb, some of it is shown, but not explained, so an understanding of the workings of the bomb is needed to understand what is going on in that respect.", "The story starts with  Leo Szilard  fleeing  Germany  on the last train out and trying to convince the military that a nuclear bomb can be built and that the Germans are already working on it. In England, his idea is filed and ignored, so he travels to the US, but there too, he has to wait a year until something is done with it and  Project Manhattan  is started.", "As Germany is being defeated and its scientists interrogated, it is found out that they have not even come close to constructing a nuclear bomb (partly due to bad cooperation by scientists). Despite the fact that no one has the technology now, and the original reason for project Manhattan is gone, work continues. Szilard, who first used Einstein to get his ideas about building a bomb across to the US leaders, now convinces him to join him in writing a letter to the president to do the opposite, namely not to build the bomb, in order to avoid an arms race. 68 scientists sign a petition, but that is held back by the military.", "U.S. President  Truman  is faced with four options: peace talks (which would require the Japanese to keep their emperor, as eventually happened), a blockade (which was thought to be cowardly), an invasion (estimated by some to cost up to a million lives, though such numbers have been widely disputed), or dropping the bomb. Another consideration is that the USSR had said they would enter the war against Japan three months after the surrender of Germany and there is a fear that they might not leave. So Truman decides that the best course of action is to drop the bomb on  Hiroshima , against the advice of General  Eisenhower .", "In order to depict a desert setting, certain scenes of the film were filmed in a town named  Notre Dame de Lourdes , located in the province of Quebec. The town offered a wide expanse of sand quarry that was used for filming."], "imdb_id": "tt0097159"},
{"title": "One Fine Day", "movie_url": "https://en.wikipedia.org/wiki/One_Fine_Day_(1996_film)", "year": "1996", "source_url": "https://en.wikipedia.org/wiki/List_of_films:_numbers", "table_data": {"image_url": "https://upload.wikimedia.org/wikipedia/en/5/5d/One_Fine_Day_%281996_film%29_poster.jpg", "Directed by": "Michael Hoffman", "Written by": "Terrel Seltzer Ellen Simon", "Produced by": "Lynda Obst", "Starring": "Michelle Pfeiffer George Clooney Mae Whitman Charles Durning", "Cinematography": "Oliver Stapleton", "Edited by": "Garth Craven", "Music by": "James Newton Howard", "Production companies": "Lynda Obst Productions Via Rosa Productions", "Distributed by": "20th Century Fox", "Release date": "December 20, 1996 ( 1996-12-20 )", "Running time": "108 minutes", "Country": "United States", "Language": "English", "Box office": "$97.5 million [ 1 ]", "Released": "December 10, 1996", "Length": "52 : 22", "Label": "Columbia"}, "info": ["One Fine Day  is a 1996 American  romantic   comedy-drama  film directed by  Michael Hoffman , starring  Michelle Pfeiffer  and  George Clooney .  Alex D. Linz  and  Mae Whitman  play their children. The title comes from the 1963 song \" One Fine Day \" by  Carole King , which is heard in the film.", "Pfeiffer served as an executive producer for the film, which was produced in association with her company Via Rosa Productions. [ 2 ]", "The film was nominated for an  Academy Award for Best Original Song  (\" For the First Time \").", "Melanie Parker is an architect whose day gets off to a bad start when she is late to drop off her son Sammy at school, due to the forgetfulness of fellow divorced father Jack Taylor, a  New York  Daily News  reporter whose daughter, Maggie, is thrust into his care that morning by his former wife who leaves to go on her honeymoon with her new husband. The children arrive just a moment too late to go on a school field trip, a  Circle Line boat cruise . Their parents realize that, on top of hectically busy schedules, they must work together that day to supervise the children. In the confusion of sharing a taxi, they accidentally switch cell phones, causing each of them, all morning, to receive calls intended for the other one, which they then have to relay to the other person.", "Melanie must make an architectural design presentation to an important client. Jack has to find a source for a scoop on the New York mayor's mob connections. Sammy causes havoc at Melanie's office with his toy cars, causing her to trip and break her scale model display. In frustration, she takes him to a day care center (which is having a \"Superhero Day\"), where she coincidentally comes across Jack trying to convince Maggie to stay and behave herself. They create impromptu costumes for the children, using his imagination and her resourcefulness. She takes her model to a shop to get it quickly repaired. Having left for a meeting, she panics when she receives a phone call from Sammy about another child having a psychedelic drug. She phones Jack in desperation and asks him to pick up the children. He agrees, on the condition that she take over their care at 3:15 while he chases down a potential news source.", "While in Melanie's care, Maggie goes missing from a store and wanders some distance down a crowded midtown sidewalk. Melanie breaks down in despair at the police station, files a missing child report, and then goes to a mayoral press conference to find Jack. He is notified by the police that Maggie has been found, and makes it to the press conference just barely in time to confront the mayor with his scoop about corruption. He had earlier tracked down its source, just as she was leaving a beauty salon in a limousine. Although they have been antagonistic, Melanie and Jack work together to take the children, by taxi, to a soccer game. She insists that she will have time first to do her presentation to the new clients, despite him protesting that it will make them late for the game. She begins her pitch over drinks at the  21 Club  lounge, but upon seeing Sammy in high spirits, she realizes that she cares more about him than her job. Insisting that she must leave immediately to be with him, she fully expects to be fired, but the clients are impressed.", "At the game, Melanie meets with her former husband, Eddie, a musician; he informs her that he will not be able to take Sammy fishing in the summer as he will be touring as a drummer with  Bruce Springsteen  instead. That evening, Jack wants a reason to visit Melanie's apartment, so he takes Maggie to buy goldfish to replace the ones that were eaten earlier in the day by a cat. At Melanie's apartment, the children watch  The Wizard of Oz  while she and Jack share a first kiss. She goes to the bathroom to freshen up; when she returns, an exhausted Jack is asleep on the sofa. She joins him and they fall asleep together, with the children happily observing.", "Clooney's character did not exist in the script's original draft. Producer Lynda Obst explained the change: \"We were being incredibly sexist. There are plenty of divorced, single working fathers going through the exact same thing.\" The studios initially wanted  Kevin Costner  or  Tom Cruise  to portray Jack Taylor, but they passed and Clooney ultimately received the part. The film was shot in 44  Manhattan  locations. [ 3 ]", "One Fine Day: Music from the Motion Picture  is the  soundtrack album  to the film. It was released on December 10, 1996, by  Columbia Records . The album peaked at number 57 on  Billboard  200  in 1997.", "One Fine Day  earned a total of $6.2 million during its opening weekend, ranking in fifth place at the box office behind  Beavis and Butt-Head Do America ,  Jerry Maguire ,  101 Dalmatians  and  Scream . [ 5 ]", "On the  review aggregator  website  Rotten Tomatoes , the film holds an approval rating of 53% based on 36 reviews, with an average rating of 5.9/10. The website's critics consensus reads, \"With a throwback 1930s vibe, this screwball romantic comedy is perfect for  One Fine Day  of folding laundry.\" [ 6 ]  It was considered a commercial disappointment by  Twentieth Century Fox . [ 7 ]", "Janet Maslin  of  The New York Times  wrote, \"A 50's romp with a few glaring 90's touches (dueling cellular phones, frazzled single parents),  One Fine Day  makes for sunny, pleasant fluff. Both stars are enjoyably breezy, and there's enough chemistry to deflect attention from the story's endless contrivances... he's [Clooney] such a natural as a movie star that he hardly needs false flattery. Ms Pfeiffer, meanwhile, shows a flair for physical comedy.\" [ 8 ]", "Roger Ebert  of the  Chicago Sun-Times  wrote, \"'Cinema is the history of boys photographing girls.' Or so  Jean-Luc Godard  is claimed to have said. I thought of his words while watching  One Fine Day , an uninspired formula movie with another fine performance by Michelle Pfeiffer. She does everything in this movie that a much better movie would have required from her, but the screenplay lets her down... Pfeiffer looks, acts and sounds wonderful throughout all of this, and George Clooney is perfectly serviceable as a romantic lead, sort of a  Mel Gibson  lite. I liked them. I wanted them to get together. I wanted them to live happily ever after. The sooner the better.\" [ 9 ]", "Rita Kempley of  The Washington Post  wrote, \"Director Michael Hoffman, whose idiosyncratic portfolio includes the period comedy  Restoration  and the spoof  Soapdish , sets a mellow pace and alternates old-fashioned split screen with crosscutting to enliven the many phone scenes. If the stars don't click, of course, nothing else matters. Happily, Pfeiffer and Clooney, now officially a movie star, not only click, they send off sparks.\" [ 10 ]", "Kenneth Turan  of the  Los Angeles Times  wrote, \" One Fine Day  is fortunate in its casting. Not only does it have Michelle Pfeiffer, whose gift for this kind of business was visible as far back as  Married to the Mob  and  The Fabulous Baker Boys , but it marks the emergence of George Clooney as a major romantic star... Still, despite feeling like its moments have been micro-managed for maximum audience response,  One Fine Day  often passes for a pleasant diversion. But with actors so suited to each other, it's too bad the film didn't give them more original material to work with.\" [ 2 ]", "Edward Guthmann of the  San Francisco Chronicle  wrote, \"We've seen it before, but Pfeiffer and Clooney do everything in their power to make it seem fresh and delightful. That's ultimately not enough, and even though the stars have some chemistry and Pfeiffer delivers her usual spotless performance,  One Fine Day  never manages to be more than a harmless, forgettable time-filler.\" [ 11 ]", "Rob Nelson of the  Boston Phoenix  wrote, \"Privilege and coincidence have always been central to  screwball comedy , but the speed of crosstown travel here rivals  Die Hard 3  for plausibility. And it's these convenient shortcuts that waylay the film from examining the condition it purports to critique: that is, the '90s compulsion to drive at full throttle.\" [ 12 ]", "One Fine Day: Music from the Motion Picture  is the  soundtrack album  to the film. It was released on December 10, 1996, by  Columbia Records . The album peaked at number 57 on  Billboard  200  in 1997.", "One Fine Day  earned a total of $6.2 million during its opening weekend, ranking in fifth place at the box office behind  Beavis and Butt-Head Do America ,  Jerry Maguire ,  101 Dalmatians  and  Scream . [ 5 ]", "On the  review aggregator  website  Rotten Tomatoes , the film holds an approval rating of 53% based on 36 reviews, with an average rating of 5.9/10. The website's critics consensus reads, \"With a throwback 1930s vibe, this screwball romantic comedy is perfect for  One Fine Day  of folding laundry.\" [ 6 ]  It was considered a commercial disappointment by  Twentieth Century Fox . [ 7 ]", "Janet Maslin  of  The New York Times  wrote, \"A 50's romp with a few glaring 90's touches (dueling cellular phones, frazzled single parents),  One Fine Day  makes for sunny, pleasant fluff. Both stars are enjoyably breezy, and there's enough chemistry to deflect attention from the story's endless contrivances... he's [Clooney] such a natural as a movie star that he hardly needs false flattery. Ms Pfeiffer, meanwhile, shows a flair for physical comedy.\" [ 8 ]", "Roger Ebert  of the  Chicago Sun-Times  wrote, \"'Cinema is the history of boys photographing girls.' Or so  Jean-Luc Godard  is claimed to have said. I thought of his words while watching  One Fine Day , an uninspired formula movie with another fine performance by Michelle Pfeiffer. She does everything in this movie that a much better movie would have required from her, but the screenplay lets her down... Pfeiffer looks, acts and sounds wonderful throughout all of this, and George Clooney is perfectly serviceable as a romantic lead, sort of a  Mel Gibson  lite. I liked them. I wanted them to get together. I wanted them to live happily ever after. The sooner the better.\" [ 9 ]", "Rita Kempley of  The Washington Post  wrote, \"Director Michael Hoffman, whose idiosyncratic portfolio includes the period comedy  Restoration  and the spoof  Soapdish , sets a mellow pace and alternates old-fashioned split screen with crosscutting to enliven the many phone scenes. If the stars don't click, of course, nothing else matters. Happily, Pfeiffer and Clooney, now officially a movie star, not only click, they send off sparks.\" [ 10 ]", "Kenneth Turan  of the  Los Angeles Times  wrote, \" One Fine Day  is fortunate in its casting. Not only does it have Michelle Pfeiffer, whose gift for this kind of business was visible as far back as  Married to the Mob  and  The Fabulous Baker Boys , but it marks the emergence of George Clooney as a major romantic star... Still, despite feeling like its moments have been micro-managed for maximum audience response,  One Fine Day  often passes for a pleasant diversion. But with actors so suited to each other, it's too bad the film didn't give them more original material to work with.\" [ 2 ]", "Edward Guthmann of the  San Francisco Chronicle  wrote, \"We've seen it before, but Pfeiffer and Clooney do everything in their power to make it seem fresh and delightful. That's ultimately not enough, and even though the stars have some chemistry and Pfeiffer delivers her usual spotless performance,  One Fine Day  never manages to be more than a harmless, forgettable time-filler.\" [ 11 ]", "Rob Nelson of the  Boston Phoenix  wrote, \"Privilege and coincidence have always been central to  screwball comedy , but the speed of crosstown travel here rivals  Die Hard 3  for plausibility. And it's these convenient shortcuts that waylay the film from examining the condition it purports to critique: that is, the '90s compulsion to drive at full throttle.\" [ 12 ]"], "imdb_id": "tt0117247"},
{"title": "One False Move", "movie_url": "https://en.wikipedia.org/wiki/One_False_Move", "year": "1992", "source_url": "https://en.wikipedia.org/wiki/List_of_films:_numbers", "table_data": {"image_url": "https://upload.wikimedia.org/wikipedia/en/d/d5/One_false_move.JPG", "Directed by": "Carl Franklin", "Written by": "Billy Bob Thornton Tom Epperson", "Produced by": "Jesse Beaton Ben Myron", "Starring": "Bill Paxton Cynda Williams Billy Bob Thornton Michael Beach Earl Billings Jim Metzler", "Cinematography": "James L. Carter", "Edited by": "Carole Kravetz", "Music by": "Peter Haycock Derek Holt Terry Plumeri", "Distributed by": "I.R.S. Releasing", "Release date": "May 8, 1992 ( 1992-05-08 )", "Running time": "105 minutes", "Country": "United States", "Language": "English", "Budget": "$2.5 million [ 1 ]", "Box office": "$1.5 million"}, "info": ["One False Move  is a 1992  American   crime thriller film  directed by  Carl Franklin  and written by  Billy Bob Thornton  and  Tom Epperson . The film stars Thornton alongside  Bill Paxton  and  Cynda Williams . The low-budget production was about to be released straight to home video when it was finished, but became popular through word of mouth, convincing the distributor to give the film a theatrical release.", "Three criminals, Ray, Pluto and Fantasia (Ray's girlfriend), commit six brutal murders over the course of one night in Los Angeles as they seek a cache of money and cocaine. The trio leave for Houston to sell the cocaine to a friend of Pluto's.", "LAPD  Detectives Dud Cole and John McFeely are investigating the case. After getting a few leads, they discover that the three are possibly headed for  Star City, Arkansas . The LAPD contacts the Star City Police Chief, Dale \"Hurricane\" Dixon, who is excited about the case, as it gives him an opportunity to do \"some real police work\". He is well-known throughout the small county, chatting with locals while on patrol. The detectives fly to Star City and meet Dale. He attempts to ingratiate himself with the detectives, whom he reveres, while they pretend to respect him.", "After stopping at a convenience store, a state trooper pulls over and attempts to arrest Ray and Pluto but Fantasia kills him as she is asked to get out of the car. Word of the trooper's murder gets to the detectives in Star City, and the trio review surveillance photos of Ray and Fantasia in the store confirming their identity. Dale informs the detectives that Fantasia is Lila Walker and she grew up in Star City. He recalls she was a troubled youth who left for Hollywood with dreams of an acting career.", "The detectives sense Dale may know Fantasia better than he is letting on after they stop by her mother's house. They question Fantasia's mother and brother Ronnie about Fantasia's whereabouts and if she had contacted them recently. They also meet a young boy, Byron, who is revealed to be Lila's young son. The detectives suspect that Lila will be coming home to see him.", "Ray, Fantasia and Pluto arrive in Houston to sell the drugs as planned. Fantasia takes a bus to Star City. Angry that their buyers are reneging on the previously agreed upon price for the cocaine, Pluto and Ray kill them and flee. They drive to Star City to meet up with Fantasia and plan their next move.", "When Fantasia arrives in Star City, she hides at a rural house. Dale confronts her, and it is revealed that the boy is Dale and Lila's son, conceived during an affair years earlier. After tense conversation, they make a deal: Lila will lure Ray and Pluto to ensure their arrest and in exchange, Dale will help her leave town.", "Pluto and Ray arrive at the house and are immediately confronted by the armed police chief. Lila distracts Dale, allowing Pluto to stab him in the stomach, during which Dale manages to shoot Pluto. Ray draws his gun and runs outside while shooting at Dale. The two fire at each other, but Fantasia stops Dale from killing Ray, only to have Ray errantly shoot her in the head. Seriously wounded, Dale steadies himself and shoots Ray to death. Pluto walks outside and falls dead in the grass. Dale calls for help with his police radio, and the LAPD detectives arrive, amazed at what the chief has accomplished. Byron walks over and talks to Dale as he lies bleeding, and he asks the boy to tell him about himself.", "Carl Franklin, who was transitioning from a career as an actor, attracted the attention of producers Jesse Beaton and Ben Myron with his American Film Institute thesis film,  Punk . [ 1 ]   Beaton and Myron, who owned the rights to  One False Move , were impressed by Franklin’s “maturity” and his understanding of the film’s subtexts of race relations, the conflicts between city and country life and gender issues. [ 1 ]", "On the  review aggregator  website  Rotten Tomatoes , 93% of 57 critics' reviews are positive, with an average rating of 8.5/10. The website's consensus reads: \" One False Move  makes nary a misstep as it unfurls a seedy caper with hard-hitting action and sly humor, marking an arresting debut for director Carl Franklin.\" [ 2 ]   Metacritic , which uses a  weighted average , assigned the film a score of 87 out of 100, based on 20 critics, indicating \"universal acclaim\". [ 3 ]", "Writing for  The Washington Post ,  Hal Hinson  praised the film: \"'One False Move' is a thriller with a hair-trigger sense of tension. Directed by newcomer Carl Franklin, its power comes from the stripped-down simplicity of its style and the unblinking savagery of its violence.\" [ 4 ]   Film critic  Roger Ebert  praised the film's director in his review: \"It is a powerful directing job. He starts with an extraordinary screenplay and then finds the right tones and moods for every scene, realizing it's not the plot we care about, it’s the people.\" [ 5 ]  At year end, film critic  Gene Siskel  voted the film as his favorite of 1992. [ 6 ]", "The film was nominated for the  Grand Prix  of the  Belgian Syndicate of Cinema Critics . [ citation needed ]", "In the United States and Canada,  One False Move  grossed $1.5   million at the box office [ 7 ]  against a budget of $2.5   million. [ 8 ]"], "imdb_id": "tt0102592"},
{"title": "One Day", "movie_url": "https://en.wikipedia.org/wiki/One_Day_(2011_film)", "year": "2011", "source_url": "https://en.wikipedia.org/wiki/List_of_films:_numbers", "table_data": {"image_url": "https://upload.wikimedia.org/wikipedia/en/a/ad/One_Day_Poster.jpg", "Directed by": "Lone Scherfig", "Screenplay by": "David Nicholls", "Based on": "One Day by David Nicholls", "Produced by": "Nina Jacobson", "Starring": "Anne Hathaway Jim Sturgess Patricia Clarkson Ken Stott Romola Garai", "Cinematography": "Benoît Delhomme [ 1 ]", "Edited by": "Barney Pilling [ 1 ]", "Music by": "Rachel Portman", "Production companies": "Random House Films Film4 Color Force", "Distributed by": "Focus Features (United States) Universal Pictures (United Kingdom)", "Release dates": "8 August 2011 ( 2011-08-08 ) ( New York City premiere ) 19 August 2011 ( 2011-08-19 ) (United States) 24 August 2011 ( 2011-08-24 ) (United Kingdom)", "Running time": "108 minutes", "Countries": "United States United Kingdom", "Language": "English", "Budget": "$15 million [ 2 ]", "Box office": "$59.4 million [ 3 ]", "Released": "August 16, 2011", "Genre": "Alternative rock Electronic Pop", "Label": "Island"}, "info": ["One Day  is a 2011   romantic drama film  directed by  Lone Scherfig  from a screenplay by  David Nicholls , based on Nicholls' 2009  novel of the same name . It stars  Anne Hathaway  and  Jim Sturgess , with  Patricia Clarkson ,  Ken Stott  and  Romola Garai  in supporting roles. It was released in the United States on 19 August 2011 by  Focus Features  and in the United Kingdom on 24 August 2011 by  Universal Pictures .", "After meeting and spending the night together on St.  Swithun 's Day on the eve of their college graduation, Dexter and Emma are shown each year over 20 years on this same date, facing small fights, hopes and missed opportunities, laughter and tears. As time goes on, we discover the true meaning of this one crucial day for them.", "A  television series adaptation  of the same source novel, starring  Ambika Mod  and  Leo Woodall  was released on  Netflix  in 2024. [ 4 ]", "Dexter Mayhew and Emma Morley meet every 15 July—St.  Swithun 's Day—over 20 years. Dexter is from a southern, wealthy, upper-class family, privately educated at  Winchester College  whilst Emma is from a lower middle-class family from northern England. On 15 July 1988, after graduation from the  University of Edinburgh , they spend a platonic night together, agreeing to \"just be friends.", "One year later, Dexter helps Emma move to London to become a writer before heading to India. Finding little success by 1990, she starts working in a Mexican restaurant, where she meets Ian, an aspiring comedian and sci-fi buff.", "World traveler Dexter works as a  TEFL  teacher in Paris. Visiting Emma on 15 July 1991, he suggests they take a holiday, so the next year they travel to  Dinard . Despite their mutual attraction, Emma turns down Dexter's advances as he lacks commitment.", "By 1993, Dexter is a successful television presenter on a raucous late-night show. Visiting his parents on 15 July 1994 after his mother's terminal cancer diagnosis, he arrives still inebriated from last night's partying, infuriating his father. Unimpressed with Dexter's wild lifestyle, she tells him he is not yet a nice person. That night, Emma has a first date with Ian; despite their lack of chemistry, they begin a relationship.", "By 1995, Emma has become a schoolteacher and lives with Ian, who increasingly irritates her. Dexter's new show makes him \"the most annoying man on telly\". Meeting Emma for dinner on 15 July 1996, Dexter gets high on  cocaine , flirts with another, and insults Emma quoting  George Bernard Shaw , \"Those who can, do; those who can't, teach.” Storming off, she declares they have outgrown each other, telling him that although she loves him, she no longer likes him.", "Two years later, now mid-30, Dexter loses his television career, failing to capture younger audiences, and by 1999, is in a serious relationship with Sylvie. Meanwhile, Emma has split up with Ian; who confronts her over their breakup and his jealousy of Dexter after reading her diary whilst she reminds him she pays the mortgage and despises  Star Trek II: The Wrath of Khan , Ian's obsession.", "Before leaving, Ian nonetheless praises her short stories, urging her to have them published. On 15 July 2000, Emma and Dexter attend the wedding of mutual friends. His old roommate Callum, now very wealthy, offers him a job. Emma reveals she has received a book deal, and Dexter that he is engaged to a pregnant Sylvie. Dexter and Emma rekindle their friendship.", "By 2001, Dexter is a devoted father to Jasmine and unaware Sylvie is cheating with Callum. Emma's book is published. Two years pass, and Dexter is divorced. He travels to Paris on the  Eurostar  to visit successful author Emma, who lives there.", "Hopeful after a previous drunken tryst with Emma following his divorce, Dexter learns of her new French, jazz musician boyfriend Jean-Pierre, so he departs. Having second thoughts, Emma chases after Dexter. They share a passionate kiss on the banks of  Canal Saint-Martin  and finally begin a relationship.", "Emma and Dexter are engaged by 2004 and eventually marry. Dexter opens a café in England, sharing custody of Jasmine, and he and Emma try, unsuccessfully, to have a child. On 15 July 2006, Emma is killed by a lorry whilst riding her bicycle.", "Inconsolable, Dexter returns to being self-destructive. Over the years, he is comforted by Sylvie, Jasmine, his widowed father, and even Ian, now working in insurance and happily married with children, who visits Dexter and tells him Emma \"lit up\" around him, assuring him that \"she made you decent... and you made her so happy\".", "On 15 July 2011, Dexter visits  Arthur's Seat  in  Edinburgh  with Jasmine. The film flashes back to 1988: after their night together, Dexter declines Emma's invitation to spend the day together, but changes his mind. They climb Arthur's Seat and at the top, he suggests that instead of being casual friends, they \"finish what they started\" the previous night. Racing back to the flat, they bump into Dexter's parents. Emma leaves, and Dexter tells them she is just a friend, but chases after her for her number. They kiss passionately, and promise to see", "The film is a co-production between  Random House Films  and  Focus Features .  Film4 Productions  is co-financing. [ 1 ]", "Actress Anne Hathaway said she was clandestinely given the script as the film was set in the United Kingdom and director Scherfig was not looking for any American actresses for the part. Hathaway flew to London for a meeting with Scherfig to explain why she should get the part. Hathaway later said it was \"the worst meeting of my life... I was just inarticulate\", but on leaving Hathaway wrote out a list of songs for Scherfig to listen to, saying, \"I clearly didn't communicate to you what I needed to today. But I think these songs can do it for me.\" Scherfig did listen to them, which led to Hathaway getting the part. [ 5 ]", "Principal photography commenced in July 2010. Filming took place on location in Scotland, England and France. [ 1 ]  The production filmed in  Edinburgh , the city where Dexter and Emma first meet, in August 2010. [ 6 ]  Various landmark locations, including  Arthur's Seat , were used. [ 7 ]  Production then moved to London.  Parliament Hill Lido  in  north London  was used for scenes in which Emma, of varying ages, swims. [ 8 ]  Filming took place inside a house in Granville Road in  Stroud Green  for scenes involving Jim Sturgess and Romola Garai. [ 9 ]  Scenes in the shop and cafe were filmed at Leila's shop and cafe on Arnold Circus, close to Brick Lane in the East End. [ 10 ]  UK railway station filming took place at Ridgmont Station on the Bedford to Bletchley  Marston Vale Line . [ 11 ]  Filming in France took place in  Dinan  and  Dinard , near  Saint-Malo , in  Brittany . A seaside club was turned into the Café Paradis, designed to ape Greek themes.", "On  Rotten Tomatoes  the film has a 37% approval rating based on 145 reviews, with an average rating of 5.1/10. The site's consensus states: \"Despite some fresh narrative twists,  One Day  lacks the emotion, depth, or insight of its bestselling source material\". [ 12 ]  On  Metacritic , it has a score of 48% based on reviews from 41 critics, indicating \"mixed or average reviews\". [ 13 ]   CinemaScore  polls reported that the average grade moviegoers gave the film was a \"B−\" on an A+ to F scale. [ 14 ]", "Betsy Sharkey of the  Los Angeles Times  called it a \"heartbreaking disappointment of a film\" [ 15 ]  while Peter Howell of the  Toronto Star  said \"Long before the credits roll, you may find yourself wishing your life could flash before your eyes, to end the monotony of this relentless turning of calendar pages.\" [ 16 ]  In contrast,  Roger Ebert  gave the film three stars out of four, saying, \" One Day  has style, freshness, and witty bantering dialogue.\" [ 17 ]  Anne Hathaway's Yorkshire accent in the role of Emma was regarded as subpar by the newspaper columnist  Suzanne Moore . Reviewing the film on  BBC Radio 4 's  Front Row , she said the accents were \"all over the shop\". Moore went on to say, \"Sometimes she's from Scotland, sometimes she's from New York, you just can't tell\". [ 18 ]", "In November 2021, it was announced that  Netflix  would be adapting the novel on which the film was based into a television series. The writing team for the series is headed by  Nicole Taylor , working with  Anna Jordan ,  Vinay Patel  and  Bijan Sheibani  and will be produced by Drama Republic, Universal International Studios and Focus Features. [ 19 ] [ 20 ]   Ambika Mod  and  Leo Woodall  are to star in the lead roles. [ 21 ]", "In November 2021, it was announced that  Netflix  would be adapting the novel on which the film was based into a television series. The writing team for the series is headed by  Nicole Taylor , working with  Anna Jordan ,  Vinay Patel  and  Bijan Sheibani  and will be produced by Drama Republic, Universal International Studios and Focus Features. [ 19 ] [ 20 ]   Ambika Mod  and  Leo Woodall  are to star in the lead roles. [ 21 ]"], "imdb_id": "tt1563738"},
{"title": "One A.M.", "movie_url": "https://en.wikipedia.org/wiki/One_A.M._(1916_film)", "year": "1916", "source_url": "https://en.wikipedia.org/wiki/List_of_films:_numbers", "table_data": {"image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/One_A.M._poster.jpg/250px-One_A.M._poster.jpg", "Directed by": "Charlie Chaplin Edward Brewer (technical director)", "Written by": "Charlie Chaplin (scenario) Vincent Bryan (scenario) Maverick Terrell (scenario)", "Produced by": "Henry P. Caulfield", "Starring": "Charlie Chaplin", "Cinematography": "William C. Foster Roland Totheroh", "Edited by": "Charlie Chaplin", "Distributed by": "Mutual Film Corporation", "Release date": "August 7, 1916 ( 1916-08-07 )", "Running time": "2 reels (full length unknown) c. 34 mins.", "Country": "United States", "Languages": "Silent film English intertitles"}, "info": ["One A.M.  is a unique  Charlie Chaplin  silent film created for  Mutual Film  in  1916 . It was the first film he starred in alone, and also one of the very few films in which he did not play  the Tramp  character.", "The film opens with a scene of a wealthy young man (Chaplin) arriving at his house in a taxi in the  morning  after a night of heavy drinking. He tries in vain to grasp the handle on the outside. He thinks, \"They really need to place the handles near the door.", "When he finally does find it after some searching, he gets out, with his hand on the open taxi window. However, in his drunkenness, he thinks his hand is stuck, and tries to pull it out. \"I never did like taxis,\" he remarks.", "He then takes out his handkerchief, blows his nose on it, and wipes the mucus onto the taxi door, in an attempt to free his hand. However, his handkerchief falls, and Charlie, in his drunkenness, never thinks of the fact that he has to just withdraw his hand and walk from the side to retrieve his handkerchief, almost wrecks the taxi and very nearly kills himself in trying to retrieve his handkerchief the hard way.", "All this while, the taxi driver ( Albert Austin ) never reacts. Thanks to a big miracle (well, according to the drunk, anyway!), Charlie withdraws his hand, and headbutts the taxi door so hard he knocks himself back inside. Fortunately, though, he'd grabbed his hanky by then. This is what has been questioned by critics—how a drunk man can have better reflexes than the average sober man.", "He looks at the money he has to pay to the taxi driver. However, the numbers are moving fast—too fast for Charlie. He stares at it for some seconds, then looks back at the scenery, and then stares back at it again, when the numbers are still moving. He thinks the numbers have gone nuts and just puts on his top hat. He then lights up his cigar and, accidentally, burns the taxi driver's hand with the lit end. He hastily pays and decides to leave.", "However, he does not observe the fact that his jacket is trapped in the closed door. His hat falls off as he's jerked back towards the taxi. He almost punctures a wheel in his attempt to free the jacket, and the door, unexpectedly, opens with a jolt. Of course, he's knocked back out.", "He walks up to his front door. When he reaches it, however, another problem faces him. He thinks that he has forgotten the key and has to enter through the window. He knocks it out and climbs in. In the process, he steps into a fishbowl placed underneath it, and then slips on a mat. He finds his key was in his coat pocket all along, and decides to enter the \"proper\" way, that is, via the door.", "However, when he enters, he slips on a mat, and for 10 seconds of some heart-in-mouth slipping and standing, the door becomes Charlie's only lean-on. Of course, the door is the worst possible option for a lean-on, and Charlie pays the price. He struggles to balance, and wonders whether he's wearing skates. He finally slips when he lets go of the door, regains his balance but soon loses it, considering he has to balance against the jacket-hanger, and then slips again, landing on his jaw.", "He retrieves himself, and walks surprisingly steadily for a few steps, until another mat approaches him, and his legs slide out from below him, causing him to fall on his back. He lands between a tiger rug and a stuffed  Eurasian lynx , which terrify him as he thinks they are real. He tries edging away from each other, only resulting in more hilarity as Charlie tries kicking the tiger rug away and then later thinks his foot is being eaten by the tiger. However, it doesn't end there. He tries to lure the lynx by giving it an air-kiss, and then walks up to it and kicks it away. That, however, ends when he proceeds onto the table.", "There, he tries to pour himself a drink, but his jacket accidentally gets stuck onto a hole in the table, and the table top spins around. Unaware of the jacket that is stuck on the table, he keeps chasing the drinks and never gives up. He tries swatting his hands over to the drinks, but they elude him. Charlie's willpower increases minute-by-minute, and his running gets faster as it does—and so does the table top. \"That's the fastest round of drinks I ever saw!\" he remarks when the drink keeps eluding him.", "By and by, Charlie tires, and stops for a second. However, he sees the drinks have stopped, too, and thinks he can get to them by just walking up to them. But alas! When he does, the table top starts spinning again, and the wild goose-chase resumes. Charlie staggers backwards, and the drinks come within his reach. However, when he tries getting them, the goose-chase resumes and Charlie continues the run.", "And  then,  of all the times, does he realize the jacket was the cause for the spinning table top. He takes it off, and walks towards the drinks, but the table keeps spinning. This is because Charlie's foot is on the jacket, and he resumes running after it. He finally falls down out of sheer exhaustion, and, lo and behold, the table top stops spinning. He looks at the drinks in wonder as they've stopped. \"What detained you?\" he asks.", "He takes the drink—and as fate would have it, poured it on the table. Seeing the glass still empty, he takes another glass and pours the drink on the table again. He then attempts to pour it directly onto the glass, and he found a way to mess that up as well—carelessly, he sloshed it everywhere around the floor and on his shoes.", "He then attempts to light a cigarette, but messes that up too. He cannot light it, and dumps it in his hat, that is, thanks to his goose-chase, on the floor, thinking of it as a dustbin, and then burns his hand with the lit end. He walks over to his hat and takes the cigar out, then dumps it on the large pool of beer he's got. \"This has been done,\" he remarks, and throws it in the hat.", "He takes out another cigarette from his cigar-pouch, slips on a carpet, unsuccessfully attempts to hang his hat against the peg, puts it on anyway, and then slips on another carpet, his head landing on the bottom of the stairs. He dumps his jacket and hat, and heads towards his drinks. Paranoid that he's in for another goose-chase, he leaps onto them. Of course, he gets them, pours them and chugs them.", "He then walks on the lynx, and thinks his leg is trapped between its legs. Of course, instead of just withdrawing his legs, he instead kicks its mouth from his left leg. As a bad element, however, his feet slide out from under him, and he lands flat on his back.", "All this has drained him. \"Good night! I'm off!\" he declares, and tries to head up the stairs to his bedroom. But at the last step, he falters, losing his balance, and, of course, slides all the 13 stairs down. He tries again, and gets knocked back down, nearly slipping on the carpet. He walks up to the drinks, drinks another glass, and staggers, falling flat on his back. Cigarette in mouth, he tries again—and fails again. He proceeds to fail several times in climbing the stairs, and a large  cuckoo clock  on the upstairs landing also poses a problem, due to its pendulum's implausibly wide swing. He becomes increasingly creative with his attempts to climb the stairs, using mountain gear, for instance, in his next attempt.", "This does not go down well. The rope is not lengthy, which means Charlie can only use it for a limited length. When he reaches the top, the rope gives in, and Charlie slides down helplessly. \"If I knew how to yodel, I'd make it!\" he remarks, upon sliding down. He tries climbing again, and, miraculously, reaches upstairs. However, the pendulum knocks into his jaw, and Charlie staggers back towards the stairs—back to where he started.", "I'll try another route.\" He tries going up the second staircase, walks all the way back down, and then wonders how he got knocked down again. He climbs up the table top, and he's already run a marathon before he can gain his balance. And he's still running the marathon as he looks determinedly to his room. \"Light exercise,\" he thinks—and falls off the next minute.", "He tries climbing via the first staircase again, and falls all the way back down again—only this time, he drags the carpet with him. Wrapped up in this carpet, he takes another shot and then tries climbing via the jacket-hanger. It is very dangerous, and Charlie's life hangs in balance for a second, until Charlie grasps hold of the staircase and manages to get to the door of his room.", "Alas! The pendulum interferes again. The next thing he knows, Charlie is sliding all the way down. He re-attempts going to his room via the same route, and this time is successful. The pendulum smashes into his jaw again, but Charlie isn't knocked down the stairs, and enters like a four-legged animal into his room.", "He searches for his  Murphy bed . Soon, the hilarity ensues again, which ends with Charlie wrecking his bed and tearing his hat. He gives up on the idea of sleeping in his bed and goes to bathroom for further inspiration. He enters the shower and, of course, in his drunken state, turns it on. He wets himself, and, soaked, he gets into the bathtub and then falls asleep under a towel.", "A reviewer for the  Louisville Herald  wrote, \"Chaplin, by himself, creates all the action that is necessary to produce the laughs for which he has become noted, and there is no doubt that this is the most exacting role the comedian has ever essayed.", "Edna Purviance 's absence from the cast was a rarity. Apart from  His New Job ,  One A.M.  was the only Chaplin film from 1915 to 1923 not to feature Purviance in some role.", "In 1932,  Amedee Van Beuren  of Van Beuren Studios, purchased Chaplin's Mutual comedies for $10,000 each, added music by  Gene Rodemich  and  Winston Sharples  and sound effects, and re-released them through  RKO Radio Pictures . Chaplin had no legal recourse to stop the RKO release. Many Chaplin fans consider this version of ‘One A.M.’ to be a brilliant combination of music and sound effects with the action. [ 1 ]", "One A.M restored and with new orchestral score 2023 -  this version is unique - available to view for free  Here"], "imdb_id": "tt0007145"},
{"title": "One Hundred Men and a Girl", "movie_url": "https://en.wikipedia.org/wiki/One_Hundred_Men_and_a_Girl", "year": "1937", "source_url": "https://en.wikipedia.org/wiki/List_of_films:_numbers", "table_data": {"image_url": "https://upload.wikimedia.org/wikipedia/en/7/75/Original_movie_poster_for_the_film_One_Hundred_Men_and_a_Girl.jpg", "Directed by": "Henry Koster", "Screenplay by": "Charles Kenyon Bruce Manning James Mulhauser", "Story by": "Hanns Kräly", "Produced by": "Joe Pasternak Charles R. Rogers", "Starring": "Deanna Durbin and Leopold Stokowski", "Cinematography": "Joseph A. Valentine", "Edited by": "Bernard W. Burton", "Music by": "Charles Previn Frank Skinner Leopold Stokowski", "Production company": "Universal Pictures", "Distributed by": "Universal Pictures", "Release date": "September 5, 1937 ( 1937-09-05 ) (USA)", "Running time": "85 minutes", "Country": "United States", "Language": "English", "Budget": "$762,000 [ 1 ] or $733,000 [ 2 ]", "Box office": "$2,270,200 [ 1 ]"}, "info": ["One Hundred Men and a Girl  (styled  100 Men and a Girl  in advertising) is a 1937 American  musical comedy film  directed by  Henry Koster  and starring  Deanna Durbin  and the maestro  Leopold Stokowski . Written by  Charles Kenyon ,  Bruce Manning , and James Mulhauser from a story by  Hanns Kräly , the film is about the daughter of a struggling musician who forms a symphony orchestra consisting of his unemployed friends. Through persistence, charm, and a few misunderstandings, they are able to get famed conductor Leopold Stokowski to lead them in a concert, which leads to a radio contract.  One Hundred Men and a Girl  was the first of two motion pictures featuring Leopold Stokowski, and is also one of the films for which Durbin is best remembered as an actress and a singer.", "John Cardwell, a  trombone  player, is only one of a large group of unemployed musicians. He tries unsuccessfully to gain an interview and audition with  Leopold Stokowski , but not to disappoint his daughter, Patricia (Patsy), he tells her that he has managed to get the job with Stokowski's orchestra. Patsy soon learns the truth and also learns that her father, desperate for rent money, has used some of the cash in a lady's evening bag he has found to pay his debts.", "The irrepressible and wilful Patsy seeks an interview with Mrs. Frost, whose bag it was, and confesses her father's actions. Mrs. Frost, a society matron and wife of rich radio station owner John R. Frost, lightheartedly offers to sponsor an orchestra of unemployed musicians. Taking her at her word, Patsy and her father recruit 100 musicians, rent a garage space and start to rehearse. Realizing that Patsy took her seriously, Mrs. Frost flees to Europe.", "Mr. Frost tells John and his friends that he will not sponsor them, as they had supposed, unless they can attract a well-recognized guest conductor to give them a 'name' and launch them on their opening night.", "Patsy, undaunted, sets out to recruit none other than Leopold Stokowski to be that conductor. Stokowski at first definitely refuses—though when Patsy sings as the orchestra is rehearsing  Mozart 's \"Alleluia\" from  Exsultate, jubilate , he strongly suggests that she seek professional voice training and eventual representation.", "By mistake, Patsy conveys the story to a newspaper music critic that Stokowski will conduct an orchestra of unemployed musicians, and that John R. Frost would broadcast the concert on the radio. When the story breaks, Frost protests his embarrassment to his friends, but they suggest valuable publicity would result. Frost immediately signs the one-hundred-man orchestra to a contract, though Patsy tries to tell them that Stokowski has not agreed.", "Stokowski is astonished and offended at the news, but Patsy enters Stokowski's palatial house surreptitiously, along with the entire orchestra. She apologizes to him and insists that he listen to the players. The conductor is so moved by their performance of  Liszt 's  Hungarian Rhapsody No. 2  that he postpones a European tour and agrees to the engagement.", "The concert is a rousing success for everyone, especially when Patsy, called upon to make a speech, instead agrees to sing the \"Brindisi\" (Drinking Song) from  Verdi 's opera  La traviata .", "Everybody said you can't top  Three Smart Girls \", said Pasternak years later. \"I said you can top anything as long as you're honest, you don't fool yourself, you get the right subject and you create a public taste for it.\" [ 3 ]", "The film was originally called  120 Men and One Girl  and was announced in December 1936. [ 4 ]   It was based on an original story and screenplay by Hans Kraly. [ 5 ]", "Leopold Stokowski  was, at the time of the film's release, co-conductor of the  Philadelphia Orchestra  with  Eugene Ormandy . Political and artistic differences with the orchestra's board had already led Stokowski to allow Ormandy to assume a greater leadership role at the orchestra and eventually would lead Stokowski to break with the orchestra entirely. This might explain why the city in which the film is set, and by extension Stokowski's \"regular\" orchestra, is never positively identified in the film.  The music was recorded in multi-channel  stereophonic sound  but released in monaural sound; three years later Stokowski and the Philadelphia Orchestra appeared in the first feature film to be presented in stereo,  Fantasia . Jane Barlow, ballerina and a student of Nijinska, was a body double for Deanna Durbin in this film. [ 6 ]", "Casting Stokowski was reportedly Durbin's idea. [ 7 ]  Stokowski signed to make the film in February 1937. [ 8 ]  His fee was reportedly $80,000. Paramount objected saying they had signed a contract with the conductor but it turned out this was only verbal. [ 9 ]  Filming started in March.", "The film opened to highly favorable critical reviews and is remembered as a hit. Of all the elements of the film, Deanna Durbin's ability to both sing  and  act drew the highest praise. [ 11 ]", "The film was nominated for the  Academy Award for Best Picture . In addition,  Charles Previn , in his role as head of the music department for  Universal Pictures , won the  Academy Award for Original Music Score . (No specific composer credit was ever specified.) Previn's scoring consisted of using two original songs (by Sam Coslow and Friedrich Hollaender) and a carefully chosen selection of music from classical symphonic works and operas. The other three awards for which this film was nominated were  Best Film Editing ,  Best Sound Mixing  ( Homer G. Tasker ), and  Best Original Story . [ 12 ]", "The film is recognized by  American Film Institute  in these lists:"], "imdb_id": "tt0029347"}